In [1]:
import numpy as np
import pandas as pd

In [3]:
ps_excel = pd.read_excel("C:/Users/Puja Shaw/Downloads/Book1.xlsx")

In [5]:
ps_excel.head(6)

     ID      Name  Salary Designation  Age
0  4455    Bikash    1000       clerk   18
1  7788      Raju    3000          pa   20
2  3322    Sajjal    4000          pe   19
3  5454    Deepti    7000         spe   24
4  1234  Gulmohar    9000          qa   28
5  6687  Britania    6000          sa   25

In [7]:
np.mean(ps_excel.Age)

22.333333333333332

In [8]:
np.mean(ps_excel.Salary)

5000.0

In [9]:
np.min(ps_excel.Age)

18

In [10]:
np.max(ps_excel.Age)

28

In [11]:
np.var(ps_excel.Age)

12.888888888888888

In [13]:
range_Age=np.max(ps_excel.Age)-np.min(ps_excel.Age)
print(range_Age)

10

In [14]:
np.std(ps_excel.Age)

3.5901098714230026

In [17]:
np.sqrt(np.var(ps_excel.Age))

3.5901098714230026

In [18]:
ps_excel.describe()

                ID       Salary        Age
count     6.000000     6.000000   6.000000
mean   4823.333333  5000.000000  22.333333
std    2363.608569  2898.275349   3.932768
min    1234.000000  1000.000000  18.000000
25%    3605.250000  3250.000000  19.250000
50%    4954.500000  5000.000000  22.000000
75%    6378.750000  6750.000000  24.750000
max    7788.000000  9000.000000  28.000000